load/results/before/fhir_sweep_vus40.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load/k6/fhir_sweep.js
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 45s max duration (incl. graceful stop):
              * fhir_steady: 40 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 40/40 VUs, 3507 complete and 0 interrupted iterations
fhir_steady   [   7% ] 40 VUs  01.0s/15s

running (02.0s), 40/40 VUs, 7165 complete and 0 interrupted iterations
fhir_steady   [  13% ] 40 VUs  02.0s/15s

running (03.0s), 40/40 VUs, 10930 complete and 0 interrupted iterations
fhir_steady   [  20% ] 40 VUs  03.0s/15s

running (04.0s), 40/40 VUs, 14680 complete and 0 interrupted iterations
fhir_steady   [  27% ] 40 VUs  04.0s/15s

running (05.0s), 40/40 VUs, 18460 complete and 0 interrupted iterations
fhir_steady   [  33% ] 40 VUs  05.0s/15s

running (06.0s), 40/40 VUs, 22214 complete and 0 interrupted iterations
fhir_steady   [  40% ] 40 VUs  06.0s/15s

running (07.0s), 40/40 VUs, 25952 complete and 0 interrupted iterations
fhir_steady   [  47% ] 40 VUs  07.0s/15s

running (08.0s), 40/40 VUs, 29760 complete and 0 interrupted iterations
fhir_steady   [  53% ] 40 VUs  08.0s/15s

running (09.0s), 40/40 VUs, 33520 complete and 0 interrupted iterations
fhir_steady   [  60% ] 40 VUs  09.0s/15s

running (10.0s), 40/40 VUs, 37306 complete and 0 interrupted iterations
fhir_steady   [  67% ] 40 VUs  10.0s/15s

running (11.0s), 40/40 VUs, 41068 complete and 0 interrupted iterations
fhir_steady   [  73% ] 40 VUs  11.0s/15s

running (12.0s), 40/40 VUs, 44878 complete and 0 interrupted iterations
fhir_steady   [  80% ] 40 VUs  12.0s/15s

running (13.0s), 40/40 VUs, 48668 complete and 0 interrupted iterations
fhir_steady   [  87% ] 40 VUs  13.0s/15s

running (14.0s), 40/40 VUs, 52496 complete and 0 interrupted iterations
fhir_steady   [  93% ] 40 VUs  14.0s/15s

running (15.0s), 40/40 VUs, 56293 complete and 0 interrupted iterations
fhir_steady   [ 100% ] 40 VUs  15.0s/15s


  █ TOTAL RESULTS 

    checks_total.......: 112712  7508.871617/s
    checks_succeeded...: 100.00% 112712 out of 112712
    checks_failed......: 0.00%   0 out of 112712

    ✓ status is 200
    ✓ has resourceType

    HTTP
    http_req_duration..............: avg=10.61ms min=3.98ms med=10.42ms p(95)=11.54ms p(99)=14.65ms max=47.43ms
      { expected_response:true }...: avg=10.61ms min=3.98ms med=10.42ms p(95)=11.54ms p(99)=14.65ms max=47.43ms
    http_req_failed................: 0.00%  0 out of 56356
    http_reqs......................: 56356  3754.435808/s

    EXECUTION
    iteration_duration.............: avg=10.64ms min=5.01ms med=10.45ms p(95)=11.57ms p(99)=14.73ms max=47.48ms
    iterations.....................: 56356  3754.435808/s
    vus............................: 40     min=40         max=40
    vus_max........................: 40     min=40         max=40

    NETWORK
    data_received..................: 16 MB  1.1 MB/s
    data_sent......................: 5.3 MB 353 kB/s



running (15.0s), 00/40 VUs, 56356 complete and 0 interrupted iterations
fhir_steady ✓ [ 100% ] 40 VUs  15s