load/results/before/fhir_sweep_vus5.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load/k6/fhir_sweep.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 45s max duration (incl. graceful stop):
              * fhir_steady: 5 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 3579 complete and 0 interrupted iterations
fhir_steady   [   7% ] 5 VUs  01.0s/15s

running (02.0s), 5/5 VUs, 7194 complete and 0 interrupted iterations
fhir_steady   [  13% ] 5 VUs  02.0s/15s

running (03.0s), 5/5 VUs, 10821 complete and 0 interrupted iterations
fhir_steady   [  20% ] 5 VUs  03.0s/15s

running (04.0s), 5/5 VUs, 14434 complete and 0 interrupted iterations
fhir_steady   [  27% ] 5 VUs  04.0s/15s

running (05.0s), 5/5 VUs, 18062 complete and 0 interrupted iterations
fhir_steady   [  33% ] 5 VUs  05.0s/15s

running (06.0s), 5/5 VUs, 21692 complete and 0 interrupted iterations
fhir_steady   [  40% ] 5 VUs  06.0s/15s

running (07.0s), 5/5 VUs, 25350 complete and 0 interrupted iterations
fhir_steady   [  47% ] 5 VUs  07.0s/15s

running (08.0s), 5/5 VUs, 28989 complete and 0 interrupted iterations
fhir_steady   [  53% ] 5 VUs  08.0s/15s

running (09.0s), 5/5 VUs, 32663 complete and 0 interrupted iterations
fhir_steady   [  60% ] 5 VUs  09.0s/15s

running (10.0s), 5/5 VUs, 36189 complete and 0 interrupted iterations
fhir_steady   [  67% ] 5 VUs  10.0s/15s

running (11.0s), 5/5 VUs, 39777 complete and 0 interrupted iterations
fhir_steady   [  73% ] 5 VUs  11.0s/15s

running (12.0s), 5/5 VUs, 43381 complete and 0 interrupted iterations
fhir_steady   [  80% ] 5 VUs  12.0s/15s

running (13.0s), 5/5 VUs, 47107 complete and 0 interrupted iterations
fhir_steady   [  87% ] 5 VUs  13.0s/15s

running (14.0s), 5/5 VUs, 50741 complete and 0 interrupted iterations
fhir_steady   [  93% ] 5 VUs  14.0s/15s

running (15.0s), 5/5 VUs, 54380 complete and 0 interrupted iterations
fhir_steady   [ 100% ] 5 VUs  15.0s/15s


  █ TOTAL RESULTS 

    checks_total.......: 108792  7252.099931/s
    checks_succeeded...: 100.00% 108792 out of 108792
    checks_failed......: 0.00%   0 out of 108792

    ✓ status is 200
    ✓ has resourceType

    HTTP
    http_req_duration..............: avg=1.35ms min=615µs    med=1.3ms  p(95)=1.67ms p(99)=1.86ms max=3.8ms 
      { expected_response:true }...: avg=1.35ms min=615µs    med=1.3ms  p(95)=1.67ms p(99)=1.86ms max=3.8ms 
    http_req_failed................: 0.00%  0 out of 54396
    http_reqs......................: 54396  3626.049965/s

    EXECUTION
    iteration_duration.............: avg=1.37ms min=820.54µs med=1.32ms p(95)=1.7ms  p(99)=1.9ms  max=5.44ms
    iterations.....................: 54396  3626.049965/s
    vus............................: 5      min=5          max=5
    vus_max........................: 5      min=5          max=5

    NETWORK
    data_received..................: 16 MB  1.1 MB/s
    data_sent......................: 5.1 MB 341 kB/s



running (15.0s), 0/5 VUs, 54396 complete and 0 interrupted iterations
fhir_steady ✓ [ 100% ] 5 VUs  15s