load/results/before/fhir_sweep_vus80.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load/k6/fhir_sweep.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 45s max duration (incl. graceful stop):
              * fhir_steady: 80 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 80/80 VUs, 3718 complete and 0 interrupted iterations
fhir_steady   [   7% ] 80 VUs  01.0s/15s

running (02.0s), 80/80 VUs, 7001 complete and 0 interrupted iterations
fhir_steady   [  13% ] 80 VUs  02.0s/15s

running (03.0s), 80/80 VUs, 10672 complete and 0 interrupted iterations
fhir_steady   [  20% ] 80 VUs  03.0s/15s

running (04.0s), 80/80 VUs, 14359 complete and 0 interrupted iterations
fhir_steady   [  27% ] 80 VUs  04.0s/15s

running (05.0s), 80/80 VUs, 18030 complete and 0 interrupted iterations
fhir_steady   [  33% ] 80 VUs  05.0s/15s

running (06.0s), 80/80 VUs, 21612 complete and 0 interrupted iterations
fhir_steady   [  40% ] 80 VUs  06.0s/15s

running (07.0s), 80/80 VUs, 25339 complete and 0 interrupted iterations
fhir_steady   [  47% ] 80 VUs  07.0s/15s

running (08.0s), 80/80 VUs, 29153 complete and 0 interrupted iterations
fhir_steady   [  53% ] 80 VUs  08.0s/15s

running (09.0s), 80/80 VUs, 32963 complete and 0 interrupted iterations
fhir_steady   [  60% ] 80 VUs  09.0s/15s

running (10.0s), 80/80 VUs, 36781 complete and 0 interrupted iterations
fhir_steady   [  67% ] 80 VUs  10.0s/15s

running (11.0s), 80/80 VUs, 40418 complete and 0 interrupted iterations
fhir_steady   [  73% ] 80 VUs  11.0s/15s

running (12.0s), 80/80 VUs, 44201 complete and 0 interrupted iterations
fhir_steady   [  80% ] 80 VUs  12.0s/15s

running (13.0s), 80/80 VUs, 48029 complete and 0 interrupted iterations
fhir_steady   [  87% ] 80 VUs  13.0s/15s

running (14.0s), 80/80 VUs, 51819 complete and 0 interrupted iterations
fhir_steady   [  93% ] 80 VUs  14.0s/15s

running (15.0s), 80/80 VUs, 55493 complete and 0 interrupted iterations
fhir_steady   [ 100% ] 80 VUs  15.0s/15s


  █ TOTAL RESULTS 

    checks_total.......: 111206  7403.308981/s
    checks_succeeded...: 100.00% 111206 out of 111206
    checks_failed......: 0.00%   0 out of 111206

    ✓ status is 200
    ✓ has resourceType

    HTTP
    http_req_duration..............: avg=21.56ms min=3.49ms med=21.21ms p(95)=22.91ms p(99)=29.3ms  max=80.44ms
      { expected_response:true }...: avg=21.56ms min=3.49ms med=21.21ms p(95)=22.91ms p(99)=29.3ms  max=80.44ms
    http_req_failed................: 0.00%  0 out of 55603
    http_reqs......................: 55603  3701.65449/s

    EXECUTION
    iteration_duration.............: avg=21.59ms min=3.52ms med=21.23ms p(95)=22.95ms p(99)=29.34ms max=80.53ms
    iterations.....................: 55603  3701.65449/s
    vus............................: 80     min=80         max=80
    vus_max........................: 80     min=80         max=80

    NETWORK
    data_received..................: 16 MB  1.1 MB/s
    data_sent......................: 5.2 MB 348 kB/s



running (15.0s), 00/80 VUs, 55603 complete and 0 interrupted iterations
fhir_steady ✓ [ 100% ] 80 VUs  15s